<?php return [
    'common'   => [
        'hello'                    => 'سلام :firstname',
        'view_order_status_online' => ' نمایش وضعیت آنلاین سفارش',
        'view_order_in_backend'    => ' نمایش سفارش در بک اند فروشگاه',
        'order_details'            => ' جزئیات سفارش',
    ],
    'payment'  => [
        'refunded' => [
            'subject'  => 'پرداخت شما استرداد شده است',
            'message'  => 'ما فقط پرداخت برای سفارش  استرداد داده ایم **#:number**.',
            'duration' => 'لطفا توجه داشته باشید ، ممکن است چند روز طول بکشد تا وجوه خود را دریافت کنید.',
        ],
        'paid'     => [
            'subject'       => 'باتشکر از پرداخت شما',
            'message'       => 'ما یک پرداخت برای سفارش دریافت کرده ایم **#:number**.',
            'process_order' => 'اکنون ما بررسی بیشتری روی سفارش انجام خواهیم داد.',
        ],
        'failed'   => [
            'subject'        => ' پرداخت برای سفارش شما ناموفق بود',
            'message'        => 'ما می خواهیم شما در اطلاع باشید که سفارش **#:number** ناموفق بود',
            'payment_advice' => '.لطفا دوباره وارد حساب کاربری خود شوید و دوباره نسبت به پرداخت سفارش اقدام کنید',
            'support'        => '. اگر شما دوباره با خطا برخوردید، لطفا با ما تماس بگیرید',
        ],
    ],
    'order'    => [
        'partials'      => [
            'billing_address'       => ' آدرس صورتحساب',
            'billing_and_shipping'  => ' آدرس صورتحساب و ارسال',
            'shipping_address'      => ' آدرس ارسال',
            'has_been_paid_on'      => 'سفارش پرداخت شده است',
            'currently_pending'     => '. پرداخت برای این سفارش در حال بررسی است',
            'track_shipping_status' => ':شما می توانید وضعیت ارسال سفارش را با استفاده از اطلاعات موجود پیگیری کنید ',
        ],
        'state_changed' => [
            'subject' => 'وضعیت سفارش شما تغییر کرد' ,
            'message' => 'سفارش شما  **#:number** به وضعیت جدید تغییر کرد: **:state**',
        ],
        'shipped'       => [
            'subject' => ' وضعیت ارسال شما تغییر کرد',
            'message' => 'سفارش شما **#:number** ارسال شد.',
        ],
    ],
    'customer' => [
        'created' => [
            'subject'       => 'به فروشگاه ما خوش آمدید, :firstname',
            'confirm_mail'  => '. به فروشگاه ما خوش آمدید! لطفا برای تائید آدرس ایمیل روی لینک زیر کلیک کنید',
            'message'       => '. به فروشگاه ما خوش آمدید! شما می توانید با آدرس ایمیل**:email** وارد فروشگاه شوید ',
            'possibilities' => '.حساب کاربری شما برای  پیگیری سفارشات  پیش ما فعال است',
            'button'        => [
                'confirm'     => 'تائید آدرس ایمیل ',
                'visit_store' => 'بازدید از فروشگاه ما',
            ],
        ],
    ],
    'checkout' => [
        'succeeded' => [
            'subject'            => 'تایید برای سفارش #:number',
            'thanks_for_order'   => ' باتشکر از سفارش شما، ما اطلاعات زیر را دریافت کرده ایم',
            'check_order_status' => '. شما می توانید وضعیت سفارش خود را با بازدید از قسمت حساب کاربری در فروشگاه ما پیگیری کنید',
        ],
        'failed'    => [
            'subject'            => 'خطا پرداخت برای سفارش #:number',
            'problem_message'    => ' متاسفانه، خطایی در مدت پرداخت پیش آمده است. ما خطا را بررسی می کنیم، و باتوجه به اطلاعات موجود با شما تماس می گیریم',
            'check_order_status' => '.  برای بررسی وضعیت سفارش شما، هر زمان می توانید وارد سایت شوید',
            'payment_id'         => 'شناسه پرداخت',
            'error'              => 'پیغام خطا',
        ],
    ],
    'admin'    => [
        'checkout_succeeded' => [
            'subject'      => 'سفارش جدید #:number',
            'order_placed' => ': این سفارش در فروشگاه موجود است',
        ],
        'checkout_failed'    => [
            'subject'       => 'پرداخت ناموفق #:number',
            'not_processed' => '. سفارش زیر به صورت صحیح قابل بررسی نیست، شاید مجبور باشید که با مشتری تماس بگیرید  ',
            'error_details' => ' جزئیات خطا',
        ],
    ],
];
