<?php
return [
    "admin" => [
        "checkout_failed" => [
            "error" => "",
            "error_details" => " جزئیات خطا",
            "not_processed" => ". سفارش زیر به صورت صحیح قابل بررسی نیست، شاید مجبور باشید که با مشتری تماس بگیرید  ",
            "payment_id" => "",
            "subject" => "پرداخت ناموفق #:number"
        ],
        "checkout_succeeded" => [
            "order_placed" => ": این سفارش در فروشگاه موجود است",
            "subject" => "سفارش جدید #:number"
        ]
    ],
    "checkout" => [
        "failed" => [
            "check_order_status" => ".  برای بررسی وضعیت سفارش شما، هر زمان می توانید وارد سایت شوید",
            "error" => "پیغام خطا",
            "payment_id" => "شناسه پرداخت",
            "problem_message" => " متاسفانه، خطایی در مدت پرداخت پیش آمده است. ما خطا را بررسی می کنیم، و باتوجه به اطلاعات موجود با شما تماس می گیریم",
            "subject" => "خطا پرداخت برای سفارش #:number"
        ],
        "succeeded" => [
            "check_order_status" => ". شما می توانید وضعیت سفارش خود را با بازدید از قسمت حساب کاربری در فروشگاه ما پیگیری کنید",
            "subject" => "تایید برای سفارش #:number",
            "thanks_for_order" => " باتشکر از سفارش شما، ما اطلاعات زیر را دریافت کرده ایم"
        ]
    ],
    "common" => [
        "hello" => "سلام :firstname",
        "order_details" => " جزئیات سفارش",
        "view_order_in_backend" => " نمایش سفارش در بک اند فروشگاه",
        "view_order_status_online" => " نمایش وضعیت آنلاین سفارش"
    ],
    "customer" => [
        "created" => [
            "button" => ["confirm" => "تائید آدرس ایمیل ", "visit_store" => "بازدید از فروشگاه ما"],
            "confirm_mail" => ". به فروشگاه ما خوش آمدید! لطفا برای تائید آدرس ایمیل روی لینک زیر کلیک کنید",
            "message" => ". به فروشگاه ما خوش آمدید! شما می توانید با آدرس ایمیل**:email** وارد فروشگاه شوید ",
            "possibilities" => ".حساب کاربری شما برای  پیگیری سفارشات  پیش ما فعال است",
            "subject" => "به فروشگاه ما خوش آمدید, :firstname"
        ]
    ],
    "order" => [
        "partials" => [
            "billing_address" => " آدرس صورتحساب",
            "billing_and_shipping" => " آدرس صورتحساب و ارسال",
            "currently_pending" => ". پرداخت برای این سفارش در حال بررسی است",
            "has_been_paid_on" => "سفارش پرداخت شده است",
            "shipping_address" => " آدرس ارسال",
            "track_shipping_status" => ":شما می توانید وضعیت ارسال سفارش را با استفاده از اطلاعات موجود پیگیری کنید "
        ],
        "shipped" => [
            "message" => "سفارش شما **#:number** ارسال شد.",
            "subject" => " وضعیت ارسال شما تغییر کرد"
        ],
        "state_changed" => [
            "message" => "سفارش شما  **#:number** به وضعیت جدید تغییر کرد: **:state**",
            "subject" => "وضعیت سفارش شما تغییر کرد"
        ]
    ],
    "payment" => [
        "failed" => [
            "message" => "ما می خواهیم شما در اطلاع باشید که سفارش **#:number** ناموفق بود",
            "payment_advice" => ".لطفا دوباره وارد حساب کاربری خود شوید و دوباره نسبت به پرداخت سفارش اقدام کنید",
            "subject" => " پرداخت برای سفارش شما ناموفق بود",
            "support" => ". اگر شما دوباره با خطا برخوردید، لطفا با ما تماس بگیرید"
        ],
        "paid" => [
            "message" => "ما یک پرداخت برای سفارش دریافت کرده ایم **#:number**.",
            "process_order" => "اکنون ما بررسی بیشتری روی سفارش انجام خواهیم داد.",
            "subject" => "باتشکر از پرداخت شما"
        ],
        "refunded" => [
            "duration" => "لطفا توجه داشته باشید ، ممکن است چند روز طول بکشد تا وجوه خود را دریافت کنید.",
            "message" => "ما فقط پرداخت برای سفارش  استرداد داده ایم **#:number**.",
            "subject" => "پرداخت شما استرداد شده است"
        ]
    ]
];
